In [235]:
#importing necessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [236]:
#loading the dataset
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [237]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [238]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [239]:
# getting the statistic info of dataframe
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [240]:
#checking for null values
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [241]:
#filling the null values
df['Age'] = df['Age'].fillna(df['Age'].mode()[0])
df['Cabin'] = df['Cabin'].fillna(df['Cabin'].mode()[0])
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])

In [242]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

Now we can see that there is no null values

In [243]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [244]:
#mean and std
Min=df[["Age","SibSp","Fare","Parch"]].mean()
std=df[["Age","SibSp","Fare","Parch"]].std()

#saving the output in output1.csv
with open("output1.csv","w") as external_file:
    print("MInimum \n",Min,"Standard Deviation \n",std,end="/n",file=external_file)
    external_file.close()

In [245]:
#calculating what percent of people survived by their PassangerId
Survival=df.groupby("Survived")["PassengerId"].count()
print(Survival)

Survived
0    549
1    342
Name: PassengerId, dtype: int64

In [246]:
#So we can see that 342 survived and 549 not survived
#calculating percentage of survived
Total=891
Survived=342
Percent_Survived=((Survived/Total)*100)
Percent_Survived=round(Percent_Survived,3)
print("Percentage of People Survived:",Percent_Survived)

Percentage of People Survived: 38.384

In [247]:
#Saving both the output in output2.csv
with open("output2.csv","w") as externalfile2:
    print(Survival,"\n\t","Percentage",Percent_Survived,file=externalfile2)
    externalfile2.close()

In [248]:
pd.crosstab([df['Survived'],df['Sex']],df['Pclass'],margins=True)

Pclass             1    2    3  All
Survived Sex
0        female    3    6   72   81
         male     77   91  300  468
1        female   91   70   72  233
         male     45   17   47  109
All              216  184  491  891

In [249]:
#woman survival rate
women = df[(df['Sex'] == 'female')]
surviving_women = df[(df['Sex'] == 'female') & (df['Survived'] == 1)]
women_chance_of_survival = surviving_women.shape[0] / women.shape[0]
format(women_chance_of_survival, ".0%")

'74%'

So From above output we can see that Female Survival Rate is 74

In [250]:
#men survival rate
men = df[(df['Sex'] == 'male')]
surviving_men = df[(df['Sex'] == 'male') & (df['Survived'] == 1)]
men_chance_of_survival = surviving_men.shape[0] / men.shape[0]
format(men_chance_of_survival, ".0%")

'19%'

So from above output we can see that male survival rate is 19 percent

In [251]:
#Saving above output in output2.csv
import csv
x=format(women_chance_of_survival, ".0%")
y=format(men_chance_of_survival, ".0%")
fields=["Women",x,"Men",y]
with open(r'output2.csv', 'a') as f:
    writer = csv.writer(f)
    writer.writerow(fields)

In [252]:
#mean age of pclass1-mean age of pclass3
Pclass=df.groupby("Pclass")["Age"].mean()
Pclass=round(Pclass,3)
print(Pclass)

Pclass
1    36.257
2    29.526
3    24.825
Name: Age, dtype: float64

In [253]:
#mean age of pclass1-mean age of pclass3
Mean_age_Pclass1=36.257
Mean_age_Pclass3=24.825
Result=(Mean_age_Pclass1-Mean_age_Pclass3)
Result=round(Result,3)
print(Result)

11.432

In [254]:
#Saving above output in output2.csv
import csv
fields=["mean age of pclass1-mean age of pclass3",Result]
with open(r'output2.csv', 'a') as f:
    writer = csv.writer(f)
    writer.writerow(fields)